#+TITLE: Spacemacs configuration
#+AUTHOR: Arnav Sharma
#+BABEL: :cache yes
#+PROPERTY: header-args :tangle yes
#+OPTIONS: toc:2
** Eshell
[[https://gitlab.com/ambrevar/emacs-fish-completion][Fish like completion]] to help with completion in eshell
#+BEGIN_SRC emacs-lisp
  (use-package fish-completion
    :defer t
    :config
    (global-fish-completion-mode)
    )
  (setq shell-default-shell 'eshell)

  #+END_SRC


Aliases
#+BEGIN_SRC emacs-lisp
  (add-hook 'eshell-mode-hook (lambda ()
      (eshell/alias "fa" "counsel-projectile-find-file $1")
      (eshell/alias "ff" "counsel-find-file $1")
      (eshell/alias "ll" "ls -l $*")
      (eshell/alias "w" "ace-window $1")
      (eshell/alias "q" "delete-window")
      (eshell/alias "d" "dired $1")
      (eshell/alias "s" "magit-status")
      (eshell/alias "m" "spacemacs/toggle-maximize-buffer")
      ))
#+END_SRC

#+RESULTS:
| (lambda nil (eshell/alias fa counsel-projectile-find-file $1) (eshell/alias ff counsel-find-file $1) (eshell/alias ll ls -l $*) (eshell/alias w ace-window $1) (eshell/alias q delete-window) (eshell/alias d dired $1) (eshell/alias s magit-status) (eshell/alias m spacemacs/toggle-maximize-buffer)) | (lambda nil (eshell/alias fa counsel-projectile-find-file $1) (eshell/alias ff counsel-find-file $1) (eshell/alias ll ls -l $*) (eshell/alias w ace-window $1) (eshell/alias q delete-window) (eshell/alias d dired $1) (eshell/alias s magit-status)) | (lambda nil (eshell/alias fa counsel-projectile-find-file $1) (eshell/alias ff counsel-find-file $1) (eshell/alias ll ls -l $*) (eshell/alias d dired $1) (eshell/alias s magit-status)) | with-editor-export-editor | (lambda nil (add-to-list (quote eshell-visual-commands) ssh) (add-to-list (quote eshell-visual-commands) tail) (add-to-list (quote eshell-visual-commands) htop)) | tramp-eshell-directory-change | spacemacs/disable-vi-tilde-fringe | spacemacs/force-yasnippet-off | spacemacs/init-eshell-xterm-color | spacemacs//eshell-switch-company-frontend | spacemacs/disable-hl-line-mode | spacemacs//init-eshell | eldoc-mode | spacemacs//init-company-eshell-mode | company-mode |


Some configuration copied from [[https://github.com/howardabrams/dot-files/blob/master/emacs-eshell.org][here]]
#+BEGIN_SRC emacs-lisp
  (setq ;; eshell-buffer-shorthand t ...  Can't see Bug#19391
   eshell-scroll-to-bottom-on-input 'all
   eshell-error-if-no-glob t
   eshell-history-size 50000
   eshell-hist-ignoredups t
   eshell-save-history-on-exit t
   eshell-prefer-lisp-functions nil
   eshell-destroy-buffer-when-process-dies t)
  (add-hook 'eshell-mode-hook
            (lambda ()
              (add-to-list 'eshell-visual-commands "ssh")
              (add-to-list 'eshell-visual-commands "tail")
              (add-to-list 'eshell-visual-commands "htop")))
#+END_SRC

Enable Plan9 like smart shell ([[https://www.masteringemacs.org/article/complete-guide-mastering-eshell][source]])
#+BEGIN_SRC emacs-lisp
(setq shell-enable-smart-eshell nil)
#+END_SRC

#+RESULTS:

Clear on ~leader-l~
#+BEGIN_SRC emacs-lisp
   (defun eshell-clear ()
     "Clear the eshell buffer."
     (interactive)
     (let ((inhibit-read-only t))
       (erase-buffer)
       (eshell-send-input)))

  (spacemacs/set-leader-keys-for-major-mode 'eshell-mode "l" 'eshell-clear)
#+END_SRC

Get history on ~leader-h~
#+BEGIN_SRC emacs-lisp
  (spacemacs/set-leader-keys-for-major-mode 'eshell-mode "h" 'counsel-esh-history)
#+END_SRC

Overwriting spacemacs eshell popup as it does not remember history ([[https://github.com/syl20bnr/spacemacs/issues/8538][issue]], [[https://github.com/howardabrams/dot-files/blob/master/emacs-eshell.org][source]])
#+BEGIN_SRC emacs-lisp
  ;; create a new eshell
  (defun eshell-new (name)

    ;; if current buffer is not of eshell
    ;; create a new window in the bottom third
    ;; TODO: fix window sizes when more than one vertical split is present

    (if (not (string= (print major-mode) "eshell-mode"))
        (progn
          (split-window-below (- (/ (window-total-height) 3)))
          (windmove-down)

          ))

    ;; if buffer name not available - create a new buffer, else switch
    (setq shellname (concat "*eshell: " name "*"))


    ;; if name is already eshell:something - don't append eshell again
    (when (string-match "eshell:" name)
      (setq shellname name))

    (if (not (get-buffer shellname))
        (progn
          (eshell "new")
          (rename-buffer  shellname))
      (switch-to-buffer shellname))
    )
#+END_SRC

#+RESULTS:
: eshell-new


Call ivy to show eshell buffers - open one if buffer does not exist. Bind to ~SPC-'~
#+BEGIN_SRC emacs-lisp

  (defun ivy-eshell-new ()
    (interactive)
    ;; find all open buffers of eshell
    (ivy-read "Eshell Buffers:" (mapcar #'buffer-name
                                        (cl-remove-if-not
                                         (lambda (buf)
                                           (with-current-buffer buf
                                             (eq major-mode 'eshell-mode)))
                                         (buffer-list))
                                        )
              :action '(1
                        ("s" eshell-new "switch to buffer"))
              ))
  (spacemacs/set-leader-keys
    "'" 'ivy-eshell-new
    "p'" 'projectile-run-eshell
    )
#+END_SRC

#+RESULTS:


Eshell quit on ~leader-q~ in normal mode
#+BEGIN_SRC emacs-lisp
  (defun exit-eshell-and-delete-window ()
    (interactive)
    (eshell-life-is-too-much)
    (delete-window))

  (defun delete-eshell-window ()
    (interactive)
    (delete-window))

  (spacemacs/set-leader-keys-for-major-mode 'eshell-mode "Q" 'exit-eshell-and-delete-window)
  (spacemacs/set-leader-keys-for-major-mode 'eshell-mode "q" 'delete-eshell-window)
#+END_SRC


** Flycheck

Flycheck hangs up in case of huge buffers ([[https://www.reddit.com/r/emacs/comments/7mjyz8/flycheck_syntax_checking_makes_editing_files/][source]]) - found this out when profiled the code
#+BEGIN_SRC emacs-lisp
  (setq flycheck-idle-change-delay 3)
  (setq flycheck-check-syntax-automatically '(save mode-enable))
#+END_SRC

#+RESULTS:
| save | mode-enable |

** Ivy config
Define ivy builders per function ([[https://emacs.stackexchange.com/questions/36745/enable-ivy-fuzzy-matching-everywhere-except-in-swiper][related source]])
#+BEGIN_SRC emacs-lisp
  (setq ivy-re-builders-alist '((counsel-M-x . ivy--regex-plus)
                                (counsel-describe-function . ivy--regex-plus)
                                (counsel-git . ivy--regex-fuzzy)
                                (counsel-projectile-find-file . ivy--regex-plus)
                                (counsel-find-file . ivy--regex-fuzzy)
                                (counsel-describe-variable . ivy--regex-plus)
                                (spacemacs/counsel-search . spacemacs/ivy--regex-plus)
                                (t . ivy--regex-ignore-order))

   )
#+END_SRC

#+RESULTS:
: ((counsel-M-x . ivy--regex-plus) (counsel-describe-function . ivy--regex-plus) (counsel-git . ivy--regex-fuzzy) (counsel-projectile-find-file . ivy--regex-plus) (counsel-find-file . ivy--regex-fuzzy) (counsel-describe-variable . ivy--regex-plus) (spacemacs/counsel-search . spacemacs/ivy--regex-plus) (t . ivy--regex-ignore-order))

Enable switching to the /special/ buffers & create and set a view ([[http://irreal.org/blog/?p=5355][source]])
#+BEGIN_SRC emacs-lisp
  (setq ivy-use-virtual-buffers t)

  (global-set-key (kbd "C-c v") 'ivy-push-view)
  (global-set-key (kbd "C-c V") 'ivy-pop-view)
  (global-set-key (kbd "C-c s") 'ivy-switch-view)
#+END_SRC
** Company mode
Low company idle delay
#+BEGIN_SRC emacs-lisp
  (setq company-idle-delay 0.2)
#+END_SRC

Trigger company completion everytime
#+BEGIN_SRC emacs-lisp
  (setq company-minimum-prefix-length 1)
#+END_SRC

#+RESULTS:
: 1

Trigger company completion only when 3 chars have been typed. Currently disabled.
#+BEGIN_SRC emacs-lisp :tangle no
(spacemacs|disable-company org-mode)
#+END_SRC

#+RESULTS:
| real-auto-save-mode | toc-org-mode | (lambda nil (org-autolist-mode)) | org-indent-mode | ob-ipython-auto-configure-kernels | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-block-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | spacemacs/org-setup-evil-surround | spacemacs/load-yasnippet | toc-org-enable | org-download-enable | org-bullets-mode | dotspacemacs//prettify-spacemacs-docs | spacemacs//org-babel-do-load-languages | spacemacs//evil-org-mode | org-eldoc-load |

Don't downcase in case of company autocomplete
#+BEGIN_SRC emacs-lisp
  (setq company-dabbrev-downcase nil)
#+END_SRC

Don't show snippet popups
#+BEGIN_SRC emacs-lisp
 (setq auto-completion-enable-snippets-in-popup nil)
#+END_SRC

Autocomplete sort by word usage
#+BEGIN_SRC emacs-lisp
 (setq auto-completion-enable-sort-by-usage t)
#+END_SRC

Don't do anything on return as prefix length is zero
#+BEGIN_SRC emacs-lisp
 (setq auto-completion-return-key-behavior 'complete)
#+END_SRC

#+RESULTS:
: complete

#+BEGIN_SRC emacs-lisp
(setq company-tooltip-align-annotations t)
#+END_SRC

#+RESULTS:
: t

Autocomplete on ~jk~
#+BEGIN_SRC emacs-lisp
(setq auto-completion-complete-with-key-sequence "jk")
#+END_SRC
*** Generic
Indent in org mode
#+BEGIN_SRC emacs-lisp
 (add-hook 'org-mode-hook 'org-indent-mode)
#+END_SRC

Enable org autolist mode
#+BEGIN_SRC emacs-lisp
 (add-hook 'org-mode-hook (lambda () (org-autolist-mode)))
#+END_SRC

#+RESULTS:
| (lambda nil (org-autolist-mode)) | real-auto-save-mode | toc-org-mode | org-indent-mode | org-clock-load | ob-ipython-auto-configure-kernels | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-block-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | spacemacs/org-setup-evil-surround | spacemacs/load-yasnippet | toc-org-enable | org-download-enable | org-bullets-mode | dotspacemacs//prettify-spacemacs-docs | spacemacs//org-babel-do-load-languages | spacemacs//evil-org-mode | org-eldoc-load | spacemacs//init-company-org-mode | company-mode |

Keep super and subscripts as it is
#+BEGIN_SRC emacs-lisp
 (setq org-use-sub-superscripts nil)
#+END_SRC

Don't startup truncated. Currently disabled.
#+BEGIN_SRC emacs-lisp :tangle no
 (setq org-startup-truncated nil)
#+END_SRC
Remap ~C-'~ to nil so that avy can work as expected
#+BEGIN_SRC emacs-lisp
 (define-key org-mode-map (kbd "C-'") nil)
#+END_SRC

Adding [[https://github.com/snosov1/toc-org/blob/master/README.org][toc-org]] to generate toc for github in buffer
#+BEGIN_SRC emacs-lisp
  (use-package toc-org
    :defer t
    :config
    (add-hook 'org-mode-hook 'toc-org-mode)
    (add-to-list 'org-tag-alist '("TOC" . ?T))
    )
#+END_SRC

#+RESULTS:
: t

** Git settings
Set =giteditor= as emacs using =witheditor=
#+BEGIN_SRC emacs-lisp
  (define-key (current-global-map)
    [remap async-shell-command] 'with-editor-async-shell-command)
  (define-key (current-global-map)
    [remap shell-command] 'with-editor-shell-command)
  (add-hook 'eshell-mode-hook 'with-editor-export-editor)
  (add-hook 'term-exec-hook   'with-editor-export-editor)
#+END_SRC

Switch to alernate window when running magit. Not sure what it does. Currently disabled.
#+BEGIN_SRC emacs-lisp :tangle no
  (add-hook 'shell-command-with-editor-mode-hook 'spacemacs/alternate-window)
#+END_SRC

Show branch name before tags
#+BEGIN_SRC emacs-lisp
 (setq magit-log-show-refname-after-summary t)
#+END_SRC

Hydra for resolving merge conflicts ([[https://github.com/alphapapa/unpackaged.el#smerge-mode][source]])
#+BEGIN_SRC emacs-lisp
  (use-package smerge-mode
    :defer t
    :config
    (defhydra unpackaged/smerge-hydra
      (:color pink :hint nil :post (smerge-auto-leave))
      "
  ^Move^       ^Keep^               ^Diff^                 ^Other^
  ^^-----------^^-------------------^^---------------------^^-------
  _n_ext       _b_ase               _<_: upper/base        _C_ombine
  _p_rev       _u_pper              _=_: upper/lower       _r_esolve
  ^^           _l_ower              _>_: base/lower        _k_ill current
  ^^           _a_ll                _R_efine
  ^^           _RET_: current       _E_diff
  "
      ("n" smerge-next)
      ("p" smerge-prev)
      ("b" smerge-keep-base)
      ("u" smerge-keep-upper)
      ("l" smerge-keep-lower)
      ("a" smerge-keep-all)
      ("RET" smerge-keep-current)
      ("\C-m" smerge-keep-current)
      ("<" smerge-diff-base-upper)
      ("=" smerge-diff-upper-lower)
      (">" smerge-diff-base-lower)
      ("R" smerge-refine)
      ("E" smerge-ediff)
      ("C" smerge-combine-with-next)
      ("r" smerge-resolve)
      ("k" smerge-kill-current)
      ("ZZ" (lambda ()
              (interactive)
              (save-buffer)
              (bury-buffer))
       "Save and bury buffer" :color blue)
      ("q" nil "cancel" :color blue))
    :hook (magit-diff-visit-file . (lambda ()
                                     (when smerge-mode
                                       (unpackaged/smerge-hydra/body)))))
#+END_SRC

#+RESULTS:
| lambda | nil | (when smerge-mode (unpackaged/smerge-hydra/body)) |


** Tramp mode
Tramp mode speedups attempts ([[https://www.emacswiki.org/emacs/TrampMode][source]])
#+BEGIN_SRC emacs-lisp
 (setq remote-file-name-inhibit-cache nil)
 (setq tramp-completion-reread-directory-timeout nil)
 (setq vc-ignore-dir-regexp
       (format "\\(%s\\)\\|\\(%s\\)"
               vc-ignore-dir-regexp
               tramp-file-name-regexp))
#+END_SRC

Run to change tramp mode verbosity
#+BEGIN_SRC emacs-lisp :tangle no
 (setq tramp-verbose 3)
#+END_SRC

#+RESULTS:
: 3

Speed up tramp on slow connections ([[https://emacs.stackexchange.com/questions/22306/working-with-tramp-mode-on-slow-connection-emacs-does-network-trip-when-i-start][source]], [[https://emacs.stackexchange.com/questions/24159/tramp-waiting-for-prompts-from-remote-shell][source]])
#+BEGIN_SRC emacs-lisp
  (setq disable-tramp-backups '("su" "sudo"))
  (setq tramp-auto-save-directory "/tmp")
  (setq tramp-ssh-controlmaster-options "")
#+END_SRC

Enviornment variables ([[https://emacs.stackexchange.com/questions/461/configuration-of-eshell-running-programs-from-directories-in-path-env-variable/2106#2106][source]])
#+BEGIN_SRC emacs-lisp
(add-to-list 'tramp-remote-path 'tramp-own-remote-path)
#+END_SRC

#+RESULTS:
| tramp-own-remote-path | tramp-default-remote-path | /bin | /usr/bin | /sbin | /usr/sbin | /usr/local/bin | /usr/local/sbin | /local/bin | /local/freeware/bin | /local/gnu/bin | /usr/freeware/bin | /usr/pkg/bin | /usr/contrib/bin | /opt/bin | /opt/sbin | /opt/local/bin |

Add this to your ~.ssh/config~
#+BEGIN_SRC sh :tangle no
Host *
ControlMaster auto
ControlPath ~/.ssh/sockets/%r@%h-%p
ControlPersist 600
#+END_SRC
** Avy
Set timeout for avy timer
#+BEGIN_SRC emacs-lisp
 (setq avy-timeout-seconds 0.3)
#+END_SRC

#+RESULTS:
: 0.3

Map ~/~ to run avy timer
#+BEGIN_SRC emacs-lisp
  (define-key evil-evilified-state-map (kbd "/") 'avy-goto-char-timer)
  (define-key evil-motion-state-map (kbd "/") 'avy-goto-char-timer)
  (define-key evil-operator-state-map (kbd "/") 'avy-goto-char-timer)
  (define-key evil-normal-state-map (kbd "/") 'avy-goto-char-timer)
#+END_SRC

#+RESULTS:
: avy-goto-char-timer

* Finish loading
#+BEGIN_SRC emacs-lisp
  (alert "Successfully loaded: booyeah" :title "Dotspacemacs")
#+END_SRC

#+RESULTS:
Wrong type argument: integer-or-marker-p, nil
(eshell-life-is-too-much)
